---
kind: type
id: T:Autodesk.Revit.DB.RoutingPreferenceRule
source: html/28dd1a35-5115-c0fb-26e3-7bce14893b89.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRule

A class representing a rule set in MEP routing preferences.

## Syntax (C#)
```csharp
public class RoutingPreferenceRule : IDisposable
```